In [1]:
import pandas as pd

In [3]:
mpg = pd.read_csv('mpg.csv')

In [24]:
mpg.head()

  manufacturer model  displ  year  cyl       trans drv  cty  hwy fl category
0         audi    a4    1.8  1999    4    auto(l5)   f   18   29  p  compact
1         audi    a4    1.8  1999    4  manual(m5)   f   21   29  p  compact
2         audi    a4    2.0  2008    4  manual(m6)   f   20   31  p  compact
3         audi    a4    2.0  2008    4    auto(av)   f   21   30  p  compact
4         audi    a4    2.8  1999    6    auto(l5)   f   16   26  p  compact

In [5]:
#Q1

In [7]:
# mpg의 category는 자동차의 특징에 따라
# 'suv', 'compact'등 7종류로 분류한 변수
# mpg의 cty는 도시 연비 의미

In [11]:
mpg.groupby(['category']) \
    .agg(mean_cty = ('cty', 'mean'))

             mean_cty
category
2seater     15.400000
compact     20.127660
midsize     18.756098
minivan     15.818182
pickup      13.000000
subcompact  20.371429
suv         13.500000

In [13]:
#Q2

In [18]:
mpg.groupby(['category']) \
    .agg(mean_cty = ('cty', 'mean')) \
    .sort_values('mean_cty', ascending = False)

             mean_cty
category
subcompact  20.371429
compact     20.127660
midsize     18.756098
minivan     15.818182
2seater     15.400000
suv         13.500000
pickup      13.000000

In [20]:
#Q3

In [22]:
# hwy는 고속도로 연비 의미

In [32]:
mpg.groupby('manufacturer') \
    .agg(mean_hwy = ('hwy','mean')) \
    .sort_values('mean_hwy', ascending = False) \
    .head(3)

               mean_hwy
manufacturer
honda         32.555556
volkswagen    29.222222
hyundai       26.857143

In [34]:
#Q4

In [44]:
mpg.query('category == "compact"')\
    .groupby('manufacturer')\
    .agg(n = ('manufacturer', 'count'))\
    .sort_values('n', ascending = False)

               n
manufacturer
audi          15
volkswagen    14
toyota        12
subaru         4
nissan         2